tap "homebrew/cask-fonts"

# Core CLI
brew "neovim"
brew "tmux"
brew "yazi"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "fd"
brew "markdownlint-cli"
brew "markdownlint-cli2"
brew "eza"
brew "zoxide"
brew "thefuck"
brew "lazygit"

# Utilities
brew "jq"
brew "wget"
brew "btop"
brew "dust"
brew "procs"
brew "tldr"
brew "git-delta"
brew "coreutils"
brew "rsync"

# Optional advanced
brew "gh"
brew "direnv"
brew "hyperfine"

# Terminals & Fonts
cask "alacritty"
cask "font-meslo-lg-nerd-font"
