tap "homebrew/cask-fonts"

brew "neovim"
brew "tmux"
brew "yazi"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "fd"
brew "ruby"
brew "markdownlint-cli"
brew "markdownlint-cli2"
brew "eza"
brew "zoxide"
brew "thefuck"
brew "node"
brew "lazygit"

cask "alacritty"
cask "iterm2"
cask "font-meslo-lg-nerd-font"
